In [ ]:
#pandas -- Panel Data
#Any data used for research or study purposes
#Obects -- 1 .Series -- 1 Column Multiple rows
#          2. Data Frame -- multiple rows and columns
# Built on numpy

In [1]:
import pandas as pd

## Series

In [2]:
## Creating series using tuple
t=(10,11,12)

d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [3]:
type(d)

pandas.core.series.Series

In [4]:
##  creating series using list
l1=[45,78,56,445,78]
d=pd.Series(l1)
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [33]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [5]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [7]:
b=pd.Series(d)

In [8]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
b['a']

1

In [9]:
b[0]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_2716\172979841.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  b[0]

1

In [15]:
b[2]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_9648\2083252473.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  b[2]

3

In [18]:
b['c']

3

In [11]:
import numpy as np

In [12]:
## Slicing operation
d=pd.Series(np.arange(10))
d[1:5]

1    1
2    2
3    3
4    4
dtype: int32

## DataFrame

In [13]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','5']]

In [14]:
a=pd.DataFrame(data)

In [15]:
a

     0     1
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     5

In [16]:
b = pd.DataFrame(data, columns=['letters','numbers'])

In [18]:
b

  letters numbers
0     abc       1
1     def       2
2     ghi       3
3     hij    None
4     klm       5

In [31]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column

In [30]:
np.random.randint(5)

1

In [19]:
d=pd.DataFrame(data,columns=['letter','numbers'],index=[np.random.randint(5) for i in range(5)])  ## changing the index

In [20]:
d

  letter numbers
2    abc       1
0    def       2
2    ghi       3
0    hij    None
2    klm       5

In [21]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [22]:
data

{'name': ['a', 'b', 'c', 'd', 'e', 'f'], 'age': [45, 12, 48, 25, 12, 56]}

In [23]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [24]:
d.columns

Index(['name', 'age'], dtype='object')

In [33]:
d.columns=['Candidate','Age_in_years']

In [25]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [32]:
d.columns

Index(['name', 'age'], dtype='object')

In [36]:
d.rename({'age':"Age_in_years"},axis=1,inplace=True)

In [37]:
d

  name  Age_in_years
0    a            45
1    b            12
2    c            48
3    d            25
4    e            12
5    f            56

In [38]:
d.max(axis=0)

name             f
Age_in_years    56
dtype: object

In [39]:
k ={"sale1": [200,500,500,700],"sales":[900,444,999,555]}
k

{'sale1': [200, 500, 500, 700], 'sales': [900, 444, 999, 555]}

In [40]:
j = pd.DataFrame(k)
j

   sale1  sales
0    200    900
1    500    444
2    500    999
3    700    555

In [42]:
j.max(axis=0)

sale1    700
sales    999
dtype: int64

In [43]:
j.sum(axis=0)

sale1    1900
sales    2898
dtype: int64

In [1]:
import pandas as pd
import numpy as np

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is E25B-F2F8

 Directory of C:\Users\LENOVO\cds\03_MLA\updated_Pandas_offcial

07-11-2024  16:45    <DIR>          .
07-11-2024  16:45    <DIR>          ..
09-07-2024  20:19    <DIR>          .ipynb_checkpoints
05-11-2024  17:21           140,115 1.pdf
26-05-2022  12:03            11,521 Pandas assignment.docx
07-11-2024  16:45           344,857 Pandas.ipynb
27-07-2021  21:59            61,194 train.csv
               4 File(s)        557,687 bytes
               3 Dir(s)   8,296,280,064 bytes free

In [3]:
pwd

'C:\\Users\\LENOVO\\cds\\03_MLA\\updated_Pandas_offcial'

In [4]:
import pandas as pd

In [44]:
## reading the data from github
data=pd.read_csv('train.csv')

In [45]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [46]:
type(data)

pandas.core.frame.DataFrame

In [10]:
##checking the head part
data.head(2)  
# displays the first 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
## checking the tail part
data.tail() # last five rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
data #[1,1,2,3,4,4,5,3,3,3]

In [8]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [48]:
data["Pclass"]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [49]:
data['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [50]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

In [51]:
data["Survived"].unique()

array([0, 1], dtype=int64)

In [52]:
data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [53]:
ls

 Volume in drive C has no label.
 Volume Serial Number is E25B-F2F8

 Directory of C:\Users\LENOVO\cds\03_MLA\updated_Pandas_offcial

30-11-2024  09:58    <DIR>          .
30-11-2024  09:58    <DIR>          ..
09-07-2024  20:19    <DIR>          .ipynb_checkpoints
05-11-2024  17:21           140,115 1.pdf
26-05-2022  12:03            11,521 Pandas assignment.docx
30-11-2024  09:58           355,895 Pandas.ipynb
27-07-2021  21:59            61,194 train.csv
               4 File(s)        568,725 bytes
               3 Dir(s)   2,046,951,424 bytes free

In [68]:
pwd

'C:\\Users\\LENOVO\\cds\\03_MLA\\updated_Pandas_offcial'

In [54]:
data.shape # shape is an attribute of the dataframe

(891, 12)

In [74]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [55]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [56]:
## Describe give statistics of numerical variables
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [57]:
## Describe with 'O' statistics of categorical variables
data.describe(include='O')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [80]:
# laying out all the unique values in that feature/column

In [81]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
data.shape

(891, 12)

In [19]:
data[]
data.iloc
data.loc

SyntaxError: invalid syntax (3602931552.py, line 1)

In [58]:
data.loc[data['Age']==60]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.25,D37,C
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.20,B41,C
684,685,0,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.00,NaN,S
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.55,NaN,S

In [60]:
data.loc[data["Fare"]<50].shape

(730, 12)

In [31]:
# get me the record of all male passengers whose age is greater 40

In [61]:
data.loc[(data['Sex']=='male') & (data['Age']>60)].shape

(19, 12)

In [62]:
data.loc[(data['Sex']=='male') & (data['Age']>60)].shape[0]

19

In [63]:
data["Survived"].isnull().sum()

0

In [64]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [65]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [66]:
data.loc[(data["Survived"]==1) & (data["Sex"]=="female")].shape

(233, 12)

In [67]:
# get me the females passenger who survived ??
data.loc[(data["Survived"]==1) & (data["Sex"]=="female")].shape[0]*100/data.loc[data["Survived"]==1].shape[0]

68.12865497076024

In [23]:
#data.loc[(data["Sex"] == "male") & (data["Age"] > 40) & (data["Cabin"].isna())]

In [68]:
#number of females in first class
data.loc[(data['Sex']=='female') & (data['Pclass']==1)].shape[0]

94

In [24]:
91*100/94

96.80851063829788

In [ ]:
#number of females that survived the titanic crash in first class

In [81]:
data.loc[(data['Sex']=='female')& (data['Pclass']==1) & (data['Survived']==1)].shape[0]

91

In [69]:
np.where(data["Age"]==25)

(array([ 75, 134, 246, 267, 271, 343, 353, 370, 442, 484, 498, 580, 666,
        685, 693, 703, 728, 729, 784, 785, 794, 880, 884], dtype=int64),)

In [26]:
# loc , iloc

In [70]:
k ={"dept":["hr","admin","sales","r&d"],"exp":[4,5,6,7]}
k

{'dept': ['hr', 'admin', 'sales', 'r&d'], 'exp': [4, 5, 6, 7]}

In [71]:
y= pd.DataFrame(k)
y

    dept  exp
0     hr    4
1  admin    5
2  sales    6
3    r&d    7

In [76]:
y.loc[0,'exp']

4

In [91]:
# integer based indexing

In [78]:
y.iloc[2,1] # only integers

6

In [31]:
y.iloc[0]

dept    hr
exp      4
Name: 0, dtype: object

In [79]:
np.where(data['Age']==80)

(array([630], dtype=int64),)

In [34]:
data.iloc[np.where(data['Age']==80)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [35]:
np.where((data['Sex']=='male')&(data['Survived']==1))

(array([ 17,  21,  23,  36,  55,  65,  74,  78,  81,  97, 107, 125, 127,
        146, 165, 183, 187, 193, 204, 207, 209, 220, 224, 226, 248, 261,
        267, 271, 283, 286, 288, 298, 301, 305, 338, 340, 348, 370, 390,
        391, 400, 407, 414, 429, 430, 444, 445, 447, 449, 453, 455, 460,
        484, 489, 507, 509, 510, 512, 543, 547, 549, 550, 553, 569, 570,
        572, 579, 587, 599, 604, 607, 621, 622, 630, 632, 643, 645, 647,
        660, 664, 673, 679, 681, 690, 692, 701, 707, 709, 712, 724, 737,
        740, 744, 751, 755, 762, 788, 802, 803, 804, 821, 827, 828, 831,
        838, 839, 857, 869, 889], dtype=int64),)

In [36]:
data.iloc[np.where((data['Sex']=='male')&(data['Survived']==1))]
#number of males survived titanic using iloc

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [128]:
data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [129]:
data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [20]:
data[data['Age'] ==60]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.25,D37,C
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.20,B41,C
684,685,0,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.00,NaN,S
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.55,NaN,S

In [21]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
data.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [80]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [81]:
data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [82]:
data.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [83]:
data.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [101]:
data.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [ ]:
# find null

In [83]:
data['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [102]:
data['Age'].isnull().sum()

177

In [103]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [104]:
data.Sex.value_counts()  # typically for categorical variables

Sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
## Getting the column names
data.columns

In [ ]:
## getting the specific column from the dataframe
data['Survived']

In [ ]:
data.Survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [105]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [110]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [111]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [109]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
pd.set_option('display.max_rows', None) ## displaying all rows

In [42]:
pd.reset_option('display.max_rows',None)

In [43]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [113]:
pd.set_option('display.max_columns',None) ## display all columns

In [84]:
## getting multiple columns
data[['Survived','Age','Sex']]

     Survived   Age     Sex
0           0  22.0    male
1           1  38.0  female
2           1  26.0  female
3           1  35.0  female
4           0  35.0    male
..        ...   ...     ...
886         0  27.0    male
887         1  19.0  female
888         0   NaN  female
889         1  26.0    male
890         0  32.0    male

[891 rows x 3 columns]

In [85]:
## want new dataframe which will have columns from  data
d1=data[['Survived','Age','Sex']]

In [86]:
d1

     Survived   Age     Sex
0           0  22.0    male
1           1  38.0  female
2           1  26.0  female
3           1  35.0  female
4           0  35.0    male
..        ...   ...     ...
886         0  27.0    male
887         1  19.0  female
888         0   NaN  female
889         1  26.0    male
890         0  32.0    male

[891 rows x 3 columns]

In [11]:
##getting specific rows from a specific column
d1[15:30]

    Survived   Age     Sex
15         1  55.0  female
16         0   2.0    male
17         1   NaN    male
18         0  31.0  female
19         1   NaN  female
20         0  35.0    male
21         1  34.0    male
22         1  15.0  female
23         1  28.0    male
24         0   8.0  female
25         1  38.0  female
26         0   NaN    male
27         0  19.0    male
28         1   NaN  female
29         0   NaN    male

In [103]:
#data

In [87]:
data.iloc[15:30,1:8]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch
15,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0
16,0,3,"Rice, Master. Eugene",male,2.0,4,1
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0
18,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0
19,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0
20,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0
21,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0
22,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0
23,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0
24,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1
25,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0
27,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0
29,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0

In [18]:
data.iloc[[15,17],4:6]

       Sex   Age
15  female  55.0
17    male   NaN

In [88]:
## searching specific values from dataframe
dff=data.loc[data['Sex']=='female']

In [89]:
dff

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [91]:
dff.Survived.value_counts()

Survived
1    233
0     81
Name: count, dtype: int64

In [137]:
81*100/314

25.796178343949045

In [92]:
# what is the average age of female passengers??
dff.Age.mean()

27.915708812260537

In [93]:
df1=dff.loc[(data['Age']>60)]

In [94]:
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

Majority of survivors were female.
Seniority may not be a condition for survival.

In [ ]:
## task:-Get all paassenger details whose age is greater than 50

In [97]:
data.loc[data['Age']>50].shape[0]

64

In [99]:
data.iloc[np.where(data['Age']>50)].shape[0]

64

In [52]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,80,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,80,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,80,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,80,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,80,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,80,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,80,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,80,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,80,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,80,0,0,370376,7.7500,NaN,Q

In [54]:
data = pd.read_csv("train.csv")

In [55]:
data.loc[(data['Sex']=='female') & (data['Age']<38)].shape # both need to be met

(196, 12)

In [56]:
data.loc[(data['Sex']=='female') | (data['Age']<38)].shape  # either or

(644, 12)

In [57]:
d1=data[['Survived','Age','Sex']]

In [58]:
## write the or condition
#d1

In [59]:
d1.loc[d1['Survived']==1].shape

(342, 3)

In [100]:
data.loc[data['Survived']==1].shape

(342, 12)

In [ ]:
data.head()

In [ ]:
data.head()

## How to create a new column

In [102]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,BBA
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN

In [105]:
## Creating new column
data['BBA']='None'

In [106]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,BBA
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,None
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,None
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,None
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,None
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,None
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,None
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,None
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,None
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,None

In [107]:
data["ageplus"]=data["Age"] +1

In [108]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,BBA,ageplus
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,None,23.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,None,39.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,None,27.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,None,36.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,None,36.0

In [12]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'BBA', 'ageplus'],
      dtype='object')

In [109]:
## Dropping of the column
data.drop(['BBA','ageplus'],axis=1,inplace=True)  ## axis=0 will refer to row and axis=1 will refer to column

In [110]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [148]:
#data.drop(["cds"],axis=1,inplace=True)

In [117]:
data.iloc[0,1]=0

In [118]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [69]:
#data["ds"]="data science"

In [119]:
data.iloc[0:4,-1]=['s','s','s','s']

In [120]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,s
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,s
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,s
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,s
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [121]:
#data.drop(["ds"],axis=1,inplace=True)

In [ ]:
data

In [58]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ds
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,data science
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,data science
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,data science
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,data science
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,data science
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,data science

In [77]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,4
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [122]:
## Dropping the row
data.drop(['Parch'],axis=1,inplace=True)

In [123]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,s
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,s
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,s
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,s
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

In [80]:
new_data=data # never do this

In [124]:
## copy as backup
new_data=data.copy()

In [125]:
new_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,s
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,s
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,s
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,s
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

In [126]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [127]:
## Dropping the multiple row
# 1st argument is a list of the row/col indices
data.drop([0,1,2],axis=0,inplace=True)

In [128]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,s
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,349909,21.0750,NaN,S

In [131]:
data=pd.read_csv("train.csv")

In [132]:
new_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,s
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,s
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,s
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,s
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

https://pandas.pydata.org/pandas-docs/stable/reference/io.html

In [133]:
## creating new column using existing coulmns
data['Family']=data['SibSp'] + data['Parch']

In [134]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [ ]:
#data.drop(1,axis=0,inplace=True)

## Sorting the dataframe

In [135]:
k={"dept":["hr","admin","sales","r&d"],"exp":[4,5,6,7],"Age":[35,25,25,66]}
k

{'dept': ['hr', 'admin', 'sales', 'r&d'],
 'exp': [4, 5, 6, 7],
 'Age': [35, 25, 25, 66]}

In [136]:
j=pd.DataFrame(k)
j

    dept  exp  Age
0     hr    4   35
1  admin    5   25
2  sales    6   25
3    r&d    7   66

In [141]:
j.sort_values(by=['Age'],ascending=False)

    dept  exp  Age
3    r&d    7   66
0     hr    4   35
1  admin    5   25
2  sales    6   25

In [143]:
j.sort_values(by=['Age','exp'],ascending=[1,1]) # False means descending order 0>> false , 1>>true

    dept  exp  Age
1  admin    5   25
2  sales    6   25
0     hr    4   35
3    r&d    7   66

In [ ]:
data.head()

In [146]:
## arranging
data.sort_values('Pclass',ascending=False)
# default ascending =True

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S,0
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S,0
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q,0
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S,1
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,PC 17482,49.5042,C90,C,0
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S,0
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,19996,52.0000,C126,S,1
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S,2

In [18]:
## arranging
data.sort_values('Pclass',ascending=True ,ignore_index=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S,2
1,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C,0
2,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C,0
3,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C,1
4,307,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S,0
887,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C,2
888,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S,0
889,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [ ]:
data

In [87]:
## arranging
#data.sort_values('Pclass',ascending=False,ignore_index=True)

In [147]:
data.sort_values(by=['Age','Pclass'],ascending=[1,0])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,1
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S,2
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C,3
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C,3
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,0
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C,0
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S,0
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C,0
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C,1

## Grouping the data

In [149]:
k ={"dept":["hr","hr","sales","sales"],"exp":[4,5,6,7],"Age":[35,25,25,66]}
k

{'dept': ['hr', 'hr', 'sales', 'sales'],
 'exp': [4, 5, 6, 7],
 'Age': [35, 25, 25, 66]}

In [150]:
h = pd.DataFrame(k)
h

    dept  exp  Age
0     hr    4   35
1     hr    5   25
2  sales    6   25
3  sales    7   66

In [151]:
h.groupby(h["dept"]).count()

       exp  Age
dept
hr       2    2
sales    2    2

In [152]:
k1 =h.groupby(h['dept']).agg({'Age':'mean','dept':'count'})

In [153]:
k1

        Age  dept
dept
hr     30.0     2
sales  45.5     2

In [154]:
type(k1)

pandas.core.frame.DataFrame

In [155]:
k1.columns = ['mean_Age','count_dept']

In [216]:
k1

       mean_Age  count_dept
dept
hr         30.0           2
sales      45.5           2

In [156]:
data.groupby(data['Pclass']).count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
Pclass,,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214,216
2,184,184,184,184,173,184,184,184,184,16,184,184
3,491,491,491,491,355,491,491,491,491,12,491,491

In [158]:
data.groupby(data['Pclass']).mean('Age')

,PassengerId,Survived,Age,SibSp,Parch,Fare,Family
Pclass,,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687,0.773148
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183,0.782609
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550,1.008147

In [159]:
data.groupby(data['Pclass']).max('Age')

        PassengerId  Survived   Age  SibSp  Parch      Fare  Family
Pclass
1               890         1  80.0      3      4  512.3292       5
2               887         1  70.0      3      3   73.5000       5
3               891         1  74.0      8      6   69.5500      10

In [160]:
data.groupby(data['Sex']).mean("Age")

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Family
Sex,,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,1.343949
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.665511

In [ ]:
# aggregation

In [161]:
data.groupby(data['Pclass']).agg({'Fare':'max','Age':'mean'})

            Fare        Age
Pclass
1       512.3292  38.233441
2        73.5000  29.877630
3        69.5500  25.140620

## Changing the datatype

In [162]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Family       891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [164]:
data['Age']=data.Age.astype('float16') # type needs tobe specific

In [165]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float16
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Family       891 non-null    int64
dtypes: float16(1), float64(1), int64(6), object(5)
memory usage: 85.4+ KB

In [ ]:
data.head()

In [ ]:
data.info()

In [166]:
data['Fare']=pd.to_numeric(data.Fare,downcast='float')

In [167]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float16
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float32
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Family       891 non-null    int64
dtypes: float16(1), float32(1), int64(6), object(5)
memory usage: 81.9+ KB

In [168]:
data['Parch']=pd.to_numeric(data.Parch,downcast='integer')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float16
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int8
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float32
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Family       891 non-null    int64
dtypes: float16(1), float32(1), int64(5), int8(1), object(5)
memory usage: 75.8+ KB

In [169]:
data['SibSp']=pd.to_numeric(data.SibSp,downcast='integer')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float16
 6   SibSp        891 non-null    int8
 7   Parch        891 non-null    int8
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float32
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Family       891 non-null    int64
dtypes: float16(1), float32(1), int64(4), int8(2), object(5)
memory usage: 69.7+ KB

In [106]:
data.SibSp

0      1
1      1
2      0
3      1
5      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: SibSp, Length: 887, dtype: int8

## break till 11:20